content/hacking/data-structures-in-popular-blockchains.md
+++
title = "Data Structures in Popular Blockchains"
author = ["Aimee Z"]
description = "Data structures in popular rust blockchains."
date = 2020-11-02
tags = ["hacking", "blockchain", "rust"]
categories = ["hacking"]
draft = false
[menu.main]
  weight = 2007
  identifier = "data-structures-in-popular-blockchains"
+++

<div class="ox-hugo-toc toc">
<div></div>

<div class="heading">Table of Contents</div>

- [Bitcoin](#bitcoin)
- [Ethereum](#ethereum)
- [Polkadot](#polkadot)
- [NEAR](#near)
- [Nervos CKB](#nervos-ckb)
- [More to do](#more-to-do)

</div>
<!--endtoc-->

Not as simple as I thought,
data structure are designed quite differently in different projects.

Let's take a look at some examples.


## [Bitcoin](https://github.com/rust-bitcoin/rust-bitcoin) {#bitcoin}

[Bitcoin Headers](https://en.bitcoin.it/wiki/Protocol%5Fdocumentation#Block%5FHeaders)

[Block hashing algorithm](https://en.bitcoin.it/wiki/Block%5Fhashing%5Falgorithm)

>A block header contains these fields:
4  Bytes Version	       		Block version number
32 Bytes hashPrevBlock		256-bit hash of the previous block header
32 Bytes hashMerkleRoot		256-bit hash based on all of the transactions in the block
4 Bytes	 Time			Current block timestamp as seconds since 1970-01-01T00:00 UTC
4 Bytes	 Bits			Current target in compact format
4 Bytes	 Nonce			32-bit number (starts at 0)

[Rust Bitcoin Library](https://docs.rs/bitcoin/0.25.0/bitcoin/)

I started with the well-known example of Bitcoin.
Its protocol is simple and clearly explained in the whitepaper.

src: rust-bitcoin/src/blockdata/block.rs

I like developers put an introduction in front of a page!

```rust
//! Bitcoin Block
//!
//! A block is a bundle of transactions with a proof-of-work attached,
//! which commits to an earlier block to form the blockchain. This
//! module describes structures and functions needed to describe
//! these blocks and the blockchain.
//!
```

A Bitcoin block data structure is simple,
and it looks like this:

```rust
/// A Bitcoin block, which is a collection of transactions with an attached
/// proof of work.
#[derive(PartialEq, Eq, Clone, Debug)]
pub struct Block {
    /// The block header
    pub header: BlockHeader,
    /// List of transactions contained in the block
    pub txdata: Vec<Transaction>
}
```

And the blockheader:

```rust
/// A block header, which contains all the block's information except
/// the actual transactions
#[derive(Copy, PartialEq, Eq, Clone, Debug)]
pub struct BlockHeader {
    /// The protocol version. Should always be 1.
    pub version: i32,
    /// Reference to the previous block in the chain
    pub prev_blockhash: BlockHash,
    /// The root hash of the merkle tree of transactions in the block
    pub merkle_root: TxMerkleNode,
    /// The timestamp of the block, as claimed by the miner
    pub time: u32,
    /// The target value below which the blockhash must lie, encoded as a
    /// a float (with well-defined rounding, of course)
    pub bits: u32,
    /// The nonce, selected to obtain a low enough blockhash
    pub nonce: u32,
}
```

In order to save disk space, Bitcoin uses Merkle tree to compress
transaction history.
[Merkle tree](https://en.wikipedia.org/wiki/Merkle%5Ftree) is a binary hash tree.
The \`merkle\_root\` in the \`BlockHeader\` struct refers to
the root of a Merkle tree,
which indicates the proof of transaction history.

[Bitcoin Whitepaper](https://bitcoin.org/bitcoin.pdf) is simple paper that explains
its architecture.

Then let's take a look at its value field, \`txdata: Vec<Transaction>\`.

```rust
//! Bitcoin Transaction
//!
//! A transaction describes a transfer of money. It consumes previously-unspent
//! transaction outputs and produces new ones, satisfying the condition to spend
//! the old outputs (typically a digital signature with a specific key must be
//! provided) and defining the condition to spend the new ones. The use of digital
//! signatures ensures that coins cannot be spent by unauthorized parties.
//!
//! This module provides the structures and functions needed to support transactions.
//!
```

[Struct bitcoin::blockdata::transaction::Transaction](https://docs.rs/bitcoin/0.25.0/bitcoin/blockdata/transaction/struct.Transaction.html)

In Bitcoin, transactions issues started with
searching for recievers' addresses.
Then find the input UTXOs with approved signature.
So the input and output data structures are a bit different.

```rust
/// A transaction output, which defines new coins to be created from old ones.
#[derive(Clone, PartialEq, Eq, Debug, Hash)]
pub struct TxOut {
    /// The value of the output, in satoshis
    pub value: u64,
    /// The script which must satisfy for the output to be spent
    pub script_pubkey: Script
}
```

```rust
/// A transaction input, which defines old coins to be consumed
#[derive(Clone, PartialEq, Eq, Debug, Hash)]
pub struct TxIn {
    /// The reference to the previous output that is being used an an input
    pub previous_output: OutPoint,
    /// The script which pushes values on the stack which will cause
    /// the referenced output's script to accept
    pub script_sig: Script,
    /// The sequence number, which suggests to miners which of two
    /// conflicting transactions should be preferred, or 0xFFFFFFFF
    /// to ignore this feature. This is generally never used since
    /// the miner behaviour cannot be enforced.
    pub sequence: u32,
    /// Witness data: an array of byte-arrays.
    /// Note that this field is *not* (de)serialized with the rest of the TxIn in
    /// Encodable/Decodable, as it is (de)serialized at the end of the full
    /// Transaction. It *is* (de)serialized with the rest of the TxIn in other
    /// (de)serialization routines.
    pub witness: Vec<Vec<u8>>
}
```
